#Вариант 24. Даны целые положительные числа N и К. Используя только операции сложения и вычитания,
#найти частное от деления нацело N на К, а также остаток от этого деления.

N = input("Введите первое целое число: ")
while type(N) != int:
    try:
        N = int(N)
        if N>0:
            break
        else:
            print("Первое число должно быть положительным")
            N = input("Введите первое целое число: ")
    except ValueError:
        print("Введено неверное значение.")
        N = input("Введите первое целое число: ")

K = input("Введите второе целое число: ")
while type(K) != int:
    try:
        K = int(K)
        if K>0:
            break
        else:
            print("Второе число должно быть положительным")
            K = input("Введите второе целое число: ")
    except ValueError:
        print("Введено неверное значение.")
        K = input("Введите второе целое число: ")