#Вариант 24. Даны целые положительные числа N и К. Используя только операции сложения и вычитания,
#найти частное от деления нацело N на К, а также остаток от этого деления.

while True:
    try:
        N = int(input("Введите первое целое число: "))
        if N>0:
            break
        else:
            print("Первое число должно быть положительным")
            N = input("Введите первое целое число: ")
    except ValueError:
        print("Введено неверное значение.")
        N = input("Введите первое целое число: ")

while True:
    try:
        K = int(input("Введите второе целое число: "))
        if K <= 0:
            print("Второе число должно быть положительным")
        elif K > N:
            print("Второе число не должно быть больше первого")
        else:
            break
    except ValueError:
        print("Введено неверное значение.")
        K = input("Введите второе целое число: ")

chastn = 0
ostatok = N

while ostatok >= K:
    chastn += 1
    ostatok -= K

print("Частное:", chastn)
print("Остаток:", ostatok)