#Вариант 24. 2. 2. Даны координаты двух различных полей шахматной 
#доски х1, у1, х2, у2 (целые числа, лежащие в диапазоне 1-8). 
#Проверить истинность высказывания: «Ладья за один ход может перейти с одного поля на другое»

while True:
    try:
        x1 = (input("Введите первое значение х: ")) #получаем начальные и конечные координаты ладьи
        x2 = (input("Введите второе значение х: "))
        y1 = (input("Введите первое значение y: "))
        y2 = (input("Введите второе значение y: "))
        if 1 <= x1 <= 8 and 1 <= x2 <= 8 and 1 <= y1 <= 8 and 1 <= y2 <= 8:
            if x1==x2 and y1==y2:
                print("Ладья осталась на месте.")
                continue
            else:
                if x1==x2 or y1==y2: #проверяем, правильно ли ладья двигается и меняет поле
                    print(True)
                else:
                    print(False)
                break
        else:
            print("Числа должны быть в пределе от 1 до 8!")
    except ValueError:
        print("Введено неверное значение!")
        continue