#Вариант 24. С начала суток прошло N секунд (N - целое). Найти количество полных минут, прошедших с начала суток.
try:
    #вводим количество секунд
    sec = int(input("Введите количество секунд с начала суток: "))
    #проверяем значение, оно не может быть отрицательным
    if sec < 0:
        print("Ошибка. Введено отрицательное значение")
    else:
        #делим на 60 без остатка, чтобы найти полное кол-во минут
        minute = sec//60
        print("Количество полных минут с начала суток; ", minute)
#исключаем возможную ошибку при введении неверного значения
except ValueError:
    print("Ошибка. Введено неверное значение")
